Autodesk.Revit.DB.IFCPropertyMappingInfo.#ctor(System.Boolean,System.String,Autodesk.Revit.DB.ElementId,System.String)
Constructs a new IFCPropertyMappingInfo with input values.
The flag that indicates whether the property is included in export.
The property name.
The Revit property id.
The Revit property id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026